Repository: Kun686/iTerm2-CN
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Notify with an alert when the selected window or session’s status changes.
zh_hans: 所选窗口或会话的状态变化时显示提醒。

# ui.swift.claudecode.cockpitwindowcontroller.sent_to_0_sessions.0993a33d
source: Sent to %1$lld sessions
zh_hans: 已发送到 %1$lld 个会话

# ui.swift.claudecode.cockpitwindowcontroller.sent_to_1_session.d2997b4c
source: Sent to 1 session
zh_hans: 已发送到 1 个会话

# ui.swift.claudecode.cockpitwindowcontroller.settings.74a883a0
source: Settings
zh_hans: 设置

source: Show only sessions in a workgroup, grouped by workgroup.
zh_hans: 仅显示工作组中的会话，并按工作组分组。

# ui.swift.claudecode.cockpitwindowcontroller.status.920e413c
source: Status
zh_hans: 状态

# ui.swift.claudecode.cockpitwindowcontroller.tab_0.675919b9
source: Tab %1$lld
zh_hans: 标签页 %1$lld

source: Type here to write to selected sessions…
zh_hans: 在此输入要发送到所选会话的命令…

source: Type @ to choose sessions to write to
zh_hans: 输入 @ 以选择要输入内容的会话

source: Type @ to pick a session, or select rows first
zh_hans: 输入 @ 选择会话，或先选择行

# ui.swift.claudecode.cockpitwindowcontroller.unknown_target_0.2076a0e8
source: Unknown target %1$@
zh_hans: 未知目标：%1$@

source: Watching for a status change on the selected item. An alert will appear on the next change, then turn this off.
zh_hans: 正在监视所选项目的状态变化。下次状态变化时会显示提醒，然后自动关闭此选项。

# ui.swift.claudecode.cockpitwindowcontroller.window.19734a1b
source: Window
zh_hans: 窗口

# ui.swift.claudecode.cockpitwindowcontroller.window_0.38ae7a46
source: Window %1$lld
zh_hans: 窗口 %1$lld

# ui.swift.claudecode.cockpitwindowcontroller.workgroup.a6d32d72
source: Workgroup
zh_hans: 工作组

source: [defunct session]
zh_hans: [已失效的会话]

source: iTerm2 session
zh_hans: iTerm2 会话

source: Untitled workgroup
zh_hans: 未命名工作组

# ui.swift.claudecode.orchestration.orchestrationtoolprovider.0_in_1.f789d5d1
source: %1$@ in %2$@
zh_hans: %2$@中的%1$@

source: Cancelling a watch
zh_hans: 正在取消监视

source: Checking state of %1$@
zh_hans: 正在检查%1$@的状态

# ui.swift.claudecode.orchestration.orchestrationtoolprovider.executing_0.55882296
source: Executing `%1$@`
zh_hans: 正在执行 `%1$@`

source: Interrupting %1$@
zh_hans: 正在中断%1$@

source: Kicking off Code Review on %1$@ %2$@
zh_hans: 正在对%1$@发起代码审查，%2$@

source: Listing active watches
zh_hans: 正在列出活动的监视

source: Listing clippings in %1$@
zh_hans: 正在列出%1$@中的剪贴项

source: Looking up workgroups
zh_hans: 正在查找工作组

# ui.swift.claudecode.orchestration.orchestrationtoolprovider.newer.804f51f7
source: newer
zh_hans: 较新

# ui.swift.claudecode.orchestration.orchestrationtoolprovider.older.da925a30
source: older
zh_hans: 较旧

source: Posting clipping “%1$@” to %2$@
zh_hans: 正在将剪贴项“%1$@”发布到%2$@

source: Reading screen of %1$@
zh_hans: 正在读取%1$@的屏幕

source: Scrolling %1$@ to show %2$@ content
zh_hans: 正在滚动%1$@以显示%2$@内容

source: Starting new session
zh_hans: 正在启动新会话

source: Starting new session: `%1$@`
zh_hans: 正在启动新会话：`%1$@`

source: the linked session
zh_hans: 关联的会话

source: Typing into %1$@: %2$@
zh_hans: 正在向%1$@输入：%2$@

source: _(unknown session)_
zh_hans: _（未知会话）_

source: _unknown workgroup_
zh_hans: _未知工作组_

# ui.swift.claudecode.orchestration.orchestrationtoolprovider.untitled.3bc7cc17
source: (untitled)
zh_hans: （未命名）

source: Will notify when %1$@ becomes **%2$@**
zh_hans: 将在%1$@变为 **%2$@** 时通知

source: Will notify when %1$@ satisfies: %2$@
zh_hans: 将在%1$@满足以下条件时通知：%2$@

# ui.swift.claudecode.orchestration.orchestrationtoolprovider.with_0.95c9673f
source: with %1$@
zh_hans: 使用%1$@

source: with saved prompt “%1$@”
zh_hans: 使用已存储的提示词“%1$@”

source: with the default prompt
zh_hans: 使用默认提示词

source: %1$@%2$@ Why it needs review: %3$@
zh_hans: %1$@%2$@ 需要审查的原因：%3$@

# ui.swift.claudecode.orchestration.orchestratordispatcher.0_in_1.f789d5d1
source: %1$@ in %2$@
zh_hans: %2$@中的%1$@

# ui.swift.claudecode.orchestration.orchestratordispatcher.a_new_session.0a8601be
source: a new session
zh_hans: 一个新会话

source: a new tab in the current window
zh_hans: 当前窗口中的新标签页

# ui.swift.claudecode.orchestration.orchestratordispatcher.a_new_window.0ae01211
source: a new window
zh_hans: 一个新窗口

source: a vertical split of the current pane
zh_hans: 当前窗格的垂直分割窗格

# ui.swift.claudecode.orchestration.orchestratordispatcher.new_session.cffdba22
source: New session
zh_hans: 新会话

source: Revoked this chat’s permission to control “%1$@”. The agent will ask before its next action there.
zh_hans: 已撤销此聊天控制“%1$@”的权限。代理在下次对其执行操作前会再次询问。

# ui.swift.claudecode.orchestration.orchestratordispatcher.run_command.87e30f34
source: Run command
zh_hans: 运行命令

source: The agent is asking to open %1$@.
zh_hans: 代理请求打开%1$@。

source: The agent is asking to open %1$@ and run “%2$@”.
zh_hans: 代理请求打开%1$@并运行“%2$@”。

source: The agent is asking to send keystrokes and interrupt running commands in session “%1$@”. Approval is sticky for the rest of this chat. Deny to refuse this and future control of this session until you explicitly approve.
zh_hans: 代理请求向会话“%1$@”发送按键并中断正在运行的命令。批准后，本次聊天的剩余期间将持续有效。拒绝后，在您明确批准之前，将拒绝此次及今后对此会话的控制。

source: The agent is asking to send keystrokes, interrupt running commands, and post clippings to this workgroup. Approval is sticky for the rest of this chat. Deny to refuse this and future control of this workgroup until you explicitly approve.
zh_hans: 代理请求发送按键、中断正在运行的命令，并向此工作组发布剪贴项。批准后，本次聊天的剩余期间将持续有效。拒绝后，在您明确批准之前，将拒绝此次及今后对此工作组的控制。

source: The agent wants to create the file `%1$@`.
zh_hans: 代理想要创建文件 `%1$@`。

source: The agent wants to run: `%1$@`
zh_hans: 代理想要运行： `%1$@`

source: The agent wants to run a command in the session.
zh_hans: 代理想要在会话中运行命令。

source: The agent wants to send this to the session's foreground program: `%1$@`
zh_hans: 代理想要将以下内容发送到会话的前台程序： `%1$@`

source: The safety check flagged this as potentially dangerous.
zh_hans: 安全检查将此操作标记为可能有危险。

source: This watch reads %1$@'s screen repeatedly while it waits. View Contents is set to Ask for this session, so allow this background reading until the watch finishes?
zh_hans: 此监视会在等待期间反复读取%1$@的屏幕。此会话的“查看内容”设为“询问”，要允许在监视结束前进行这种后台读取吗？

# ui.swift.claudecode.peersessionsettingsviewcontroller.command.a7a9c915
source: Command:
zh_hans: 命令：

source: Command to run in this pane. Changes take effect the next time the pane is restarted.
zh_hans: 在此窗格中运行的命令。更改将在下次重新启动窗格时生效。

source: Claude Code is running. Want to try the Claude Code integration?
zh_hans: Claude Code 正在运行。要试用 Claude Code 集成吗？

# ui.swift.claudecodemodecontroller.don_t_show_again.ed668c0d
source: Don't Show Again
zh_hans: 不再显示

# ui.swift.claudecodemodecontroller.try_it_now.8491bd52
source: Try It Now
zh_hans: 立即试用

# ui.swift.clippings.addclippingpanel.add.9fd728c6
source: Add
zh_hans: 添加

# ui.swift.clippings.addclippingpanel.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.clippings.addclippingpanel.detail.764c9157
source: Detail:
zh_hans: 内容：

# ui.swift.clippings.addclippingpanel.new_clipping.466f535a
source: New Clipping
zh_hans: 新建片段

# ui.swift.clippings.addclippingpanel.title.ecd11fd9
source: Title:
zh_hans: 标题：

# ui.swift.clippings.clippingsview.add_clipping.570aebb8
source: Add clipping
zh_hans: 添加片段

# ui.swift.clippings.clippingsview.archive_all_clippings.dbed617d
source: Archive all clippings
zh_hans: 归档所有片段

# ui.swift.clippings.clippingsview.archive_clippings.dc02246f
source: Archive clippings
zh_hans: 归档片段

# ui.swift.clippings.clippingsview.copy_clipping.da47ae97
source: Copy clipping
zh_hans: 拷贝片段

# ui.swift.clippings.clippingsview.copy_selected_to_pasteboard.2d1b39cc
source: Copy selected to pasteboard
zh_hans: 将所选片段拷贝到剪贴板

# ui.swift.clippings.clippingsview.hide_clippings.a770961e
source: Hide clippings
zh_hans: 隐藏片段

# ui.swift.clippings.clippingsview.next_archived_clippings.4f65ac0e
source: Next archived clippings
zh_hans: 下一组归档片段

# ui.swift.clippings.clippingsview.preview_clipping.f198004d
source: Preview clipping
zh_hans: 预览片段

# ui.swift.clippings.clippingsview.preview_space.0bae4ec9
source: Preview (Space)
zh_hans: 预览（空格键）

# ui.swift.clippings.clippingsview.previous_archived_clippings.596b4d2d
source: Previous archived clippings
zh_hans: 上一组归档片段

# ui.swift.clippings.clippingsview.remove_clipping.58f05b90
source: Remove clipping
zh_hans: 移除片段

# ui.swift.clippings.clippingsview.remove_selected_clipping.ebd86e44
source: Remove selected clipping
zh_hans: 移除所选片段

# ui.swift.clippings.clippingsview.send_clipping.00a44731
source: Send clipping
zh_hans: 发送片段

# ui.swift.clippings.clippingsview.send_selected_to_terminal.5e1acbd4
source: Send selected to terminal
zh_hans: 将所选片段发送到终端

# ui.swift.clippings.clippingsview.show_next_archived_clippings.5f89fba3
source: Show next archived clippings
zh_hans: 显示下一组归档片段

# ui.swift.clippings.clippingsview.show_previous_archived_clippings.027401d9
source: Show previous archived clippings
zh_hans: 显示上一组归档片段

# ui.swift.clippings.clippingsview.viewing_archived_clippings_0_of_1.b37bc579
source: Viewing archived clippings (%1$lld of %2$lld)
zh_hans: 正在查看归档片段（第 %1$lld 项，共 %2$lld 项）

source: Alerts will be delivered to your paired iPhone.
zh_hans: 提醒将发送到已配对的 iPhone。

source: Open iTerm2 Buddy on your paired iPhone (update it if needed).
zh_hans: 在已配对的 iPhone 上打开 iTerm2 Buddy（如有需要，请先更新）。

source: Pair an iPhone running iTerm2 Buddy to use this.
zh_hans: 配对一部运行 iTerm2 Buddy 的 iPhone 后即可使用此功能。

source: Turn on notifications for iTerm2 Buddy in iOS Settings.
zh_hans: 请在 iOS 设置中开启 iTerm2 Buddy 的通知。

source: Turn this on to allow notifications on your iPhone.
zh_hans: 开启此选项以允许在 iPhone 上接收通知。

# ui.swift.companion.companionpairingcontroller.bonjour_dns_error_0.2e53115e
source: Bonjour/DNS error %1$@
zh_hans: Bonjour/DNS 错误 %1$@

source: Companion Device Needs an Update
zh_hans: Companion 设备需要更新

source: Enter the code shown on your iPhone.
zh_hans: 输入 iPhone 上显示的代码。

source: iTerm2 has moved to the new relay. For your Mac and iPhone to keep connecting, update the iTerm2 Buddy app on your iPhone to the latest version.
zh_hans: iTerm2 已迁移到新的中继服务。为使 Mac 和 iPhone 保持连接，请将 iPhone 上的 iTerm2 Buddy App 更新到最新版本。

# ui.swift.companion.companionpairingcontroller.iterm2_needs_an_update.63b20457
source: iTerm2 Needs an Update
zh_hans: iTerm2 需要更新

# ui.swift.companion.companionpairingcontroller.later.73b6e48a
source: Later
zh_hans: 稍后

# ui.swift.companion.companionpairingcontroller.ok.565339bc
source: OK
zh_hans: 好

source: pair a companion device with this Mac
zh_hans: 将 Companion 设备与这台 Mac 配对

# ui.swift.companion.companionpairingcontroller.pairing_declined.7c0529c9
source: Pairing declined.
zh_hans: 配对已被拒绝。

source: Phone connected. Securing the connection…
zh_hans: 手机已连接。正在保护连接…

# ui.swift.companion.companionpairingcontroller.re_pair.64484c76
source: Re-pair…
zh_hans: 重新配对…

source: Re-pair Your Companion Device
zh_hans: 重新配对 Companion 设备

# ui.swift.companion.companionpairingcontroller.reconnecting_to_the_relay.a5da61c3
source: Reconnecting to the relay…
zh_hans: 正在重新连接中继服务…

source: That code doesn’t match. Check your iPhone and try again.
zh_hans: 代码不匹配。请检查您的 iPhone 后重试。

source: The iTerm2 Buddy app on your phone is too old to connect to this version of iTerm2. Update the iPhone app to continue.
zh_hans: 您手机上的 iTerm2 Buddy App 版本过旧，无法连接到此版本的 iTerm2。请更新 iPhone App 以继续。

source: The iTerm2 server has moved to a new address. Your paired iPhone is still registered with the old server. The old server will go away soon. You should re-pair to avoid problems when that happens.
zh_hans: iTerm2 服务器已迁移到新地址。您已配对的 iPhone 仍注册在旧服务器上，而旧服务器即将停用。您应重新配对，以免届时出现问题。

# ui.swift.companion.companionpairingcontroller.the_mac_identity_key.079903c3
source: the Mac identity key
zh_hans: Mac 身份密钥

# ui.swift.companion.companionpairingcontroller.the_paired_phone_key.740632a7
source: the paired phone key
zh_hans: 已配对手机的密钥

source: This version of iTerm2 is too old to connect to the iTerm2 Buddy app on your phone. Update iTerm2 to continue.
zh_hans: 此版本的 iTerm2 过旧，无法连接到您手机上的 iTerm2 Buddy App。请更新 iTerm2 以继续。

# ui.swift.companion.companionpairingcontroller.tls_error_0.c1e46a70
source: TLS error %1$@
zh_hans: TLS 错误 %1$@

source: Update iTerm2 Buddy on your iPhone
zh_hans: 在 iPhone 上更新 iTerm2 Buddy

# ui.swift.companion.companionpairingcontroller.waiting_for_your_iphone.cc26edb8
source: Waiting for your iPhone…
zh_hans: 正在等待您的 iPhone…

source: Your paired iPhone can’t connect because some pairing information stored on this Mac is missing (%1$@). This can happen after reinstalling or rebuilding iTerm2, or after a keychain reset. Re-pair to fix it.
zh_hans: 您已配对的 iPhone 无法连接，因为这台 Mac 上缺少部分配对信息（%1$@）。重新安装或重新构建 iTerm2、或者重置钥匙串后可能出现此情况。请重新配对以修复。

# ui.swift.companion.companionpairingwindowcontroller.0_h_1_m.d426ce3b
source: %1$lldh %2$@m
zh_hans: %1$lld小时 %2$@分钟

# ui.swift.companion.companionpairingwindowcontroller.0_m_1_s.661f2349
source: %1$lldm %2$@s
zh_hans: %1$lld分钟 %2$@秒

# ui.swift.companion.companionpairingwindowcontroller.0_s.c4c041f8
source: %1$llds
zh_hans: %1$lld秒

source: A companion device is paired and connected.
zh_hans: Companion 设备已配对并连接。

source: A companion device is paired but iTerm2 isn’t listening for it yet. Reconnecting…
zh_hans: Companion 设备已配对，但 iTerm2 尚未监听其连接。正在重新连接…

source: A companion device is paired. Waiting for it to connect.
zh_hans: Companion 设备已配对。正在等待其连接。

source: Allow companion device pairing
zh_hans: 允许 Companion 设备配对

# ui.swift.companion.companionpairingwindowcontroller.authenticate.2212860e
source: Authenticate
zh_hans: 认证

source: Authenticate to pair a companion device with this Mac.
zh_hans: 进行认证以将 Companion 设备与这台 Mac 配对。

source: Authentication is required to pair a companion device.
zh_hans: 配对 Companion 设备需要认证。

# ui.swift.companion.companionpairingwindowcontroller.cancel_pairing.057227bc
source: Cancel Pairing
zh_hans: 取消配对

# ui.swift.companion.companionpairingwindowcontroller.check_again.fb7099ad
source: Check again
zh_hans: 再次检查

source: Check again for the plugin
zh_hans: 再次检查插件

source: Companion device connection status
zh_hans: Companion 设备连接状态

source: Companion device pairing has been disabled. Check with your system administrator.
zh_hans: Companion 设备配对已被禁用。请联系系统管理员。

source: Companion Device Settings
zh_hans: Companion 设备设置

source: Connected to relay for %1$@
zh_hans: 已连接中继服务 %1$@

source: Could not start pairing: %1$@
zh_hans: 无法开始配对：%1$@

source: Daily relay data limit reached (reconnecting…)
zh_hans: 已达到每日中继数据限额（正在重新连接…）

source: Daily relay data limit reached (retry in %1$@)
zh_hans: 已达到每日中继数据限额（%1$@后重试）

# ui.swift.companion.companionpairingwindowcontroller.device_disconnected.2e41a8a7
source: Device disconnected.
zh_hans: 设备已断开连接。

# ui.swift.companion.companionpairingwindowcontroller.download_plugin.789b28ff
source: Download Plugin…
zh_hans: 下载插件…

source: In the iTerm2 Buddy app on your iPhone, tap Scan and point the camera at this code.
zh_hans: 在 iPhone 上的 iTerm2 Buddy App 中轻点“扫描”，然后将摄像头对准此代码。

source: Install Companion App on your iPhone
zh_hans: 在 iPhone 上安装 Companion App

source: Install the iTerm2 Companion plugin below, then allow companion device pairing.
zh_hans: 请在下方安装 iTerm2 Companion 插件，然后允许 Companion 设备配对。

source: iTerm2 Companion plugin installed and working ✅
zh_hans: iTerm2 Companion 插件已安装并正常工作 ✅

source: iTerm2 Companion plugin not installed
zh_hans: 未安装 iTerm2 Companion 插件

source: Not connected to relay
zh_hans: 未连接到中继服务

source: Not connected to relay (last try %1$@ ago)
zh_hans: 未连接到中继服务（上次尝试在 %1$@ 前）

source: Pair a companion device to use iTerm2 from your iPhone.
zh_hans: 配对 Companion 设备，以便从 iPhone 使用 iTerm2。

# ui.swift.companion.companionpairingwindowcontroller.pairing_failed_0.ac70a54c
source: Pairing failed: %1$@
zh_hans: 配对失败：%1$@

# ui.swift.companion.companionpairingwindowcontroller.relay_room_name.bc48ca32
source: Relay room name
zh_hans: 中继房间名称

# ui.swift.companion.companionpairingwindowcontroller.reveal.36b830bd
source: Reveal
zh_hans: 显示

# ui.swift.companion.companionpairingwindowcontroller.reveal_in_finder.cc849385
source: Reveal in Finder
zh_hans: 在 Finder 中显示

# ui.swift.companion.companionpairingwindowcontroller.reveal_in_settings.21379104
source: Reveal in Settings
zh_hans: 在设置中显示

# ui.swift.companion.companionpairingwindowcontroller.show_qr_code.ef925995
source: Show QR Code
zh_hans: 显示二维码

source: To pair a different device, unpair first. Unpairing kicks the device off and deletes the pairing keys.
zh_hans: 要配对其他设备，请先取消配对。取消配对会断开该设备并删除配对密钥。

source: Turn on “Allow companion device pairing” below to begin.
zh_hans: 开启下方的“允许 Companion 设备配对”以开始。

source: Type the 6-digit code shown on your iPhone. This confirms you’re pairing with your own phone.
zh_hans: 输入 iPhone 上显示的 6 位代码。这可确认您正在与自己的手机配对。

# ui.swift.companion.companionpairingwindowcontroller.unpair.10be2fd8
source: Unpair
zh_hans: 取消配对

# ui.swift.companion.companionpairingwindowcontroller.verify.eea2745e
source: Verify
zh_hans: 验证

source: Waiting for your iPhone…
zh_hans: 正在等待您的 iPhone…

source: You must enable AI features in settings before you can pair a companion device.
zh_hans: 必须先在设置中启用 AI 功能，才能配对 Companion 设备。

source: You must install the AI plugin before you can pair a companion device.
zh_hans: 必须先安装 AI 插件，才能配对 Companion 设备。

# ui.swift.companion.companionplugininstaller.ai_plugin.9412826a
source: AI plugin
zh_hans: AI 插件

# ui.swift.companion.companionplugininstaller.companion_plugin.56041357
source: companion plugin
zh_hans: Companion 插件

source: Could not find iTerm2’s Application Support directory.
zh_hans: 找不到 iTerm2 的“应用程序支持”目录。

source: Could not unpack the downloaded plugin: %1$@
zh_hans: 无法解压下载的插件：%1$@

# ui.swift.companion.companionplugininstaller.download_failed_0.7f360187
source: Download failed: %1$@
zh_hans: 下载失败：%1$@

source: Download failed with HTTP status %1$lld.
zh_hans: 下载失败，HTTP 状态码为 %1$lld。

source: The %1$@ did not load after installation.
zh_hans: %1$@安装后未能加载。

source: The downloaded archive did not contain a plugin.
zh_hans: 下载的归档中不包含插件。

source: Companion device connected
zh_hans: 伴侣设备已连接

source: Companion device paired (not connected)
zh_hans: 伴侣设备已配对（未连接）

source: Companion Device Settings…
zh_hans: Companion 设备设置…

# ui.swift.companion.companionpresencecontroller.iterm2_buddy_connected.22edfa6f
source: iTerm2 Buddy connected
zh_hans: iTerm2 Buddy 已连接

source: iTerm2 Buddy disconnected
zh_hans: iTerm2 Buddy 已断开连接

# ui.swift.companion.companionsessionlister.window_0.38ae7a46
source: Window %1$lld
zh_hans: 窗口 %1$lld

source: AI and companion plugins
zh_hans: AI 和 Companion 插件

# ui.swift.companion.companionwizardwindowcontroller.api_key.2f77effd
source: API key:
zh_hans: API 密钥：

# ui.swift.companion.companionwizardwindowcontroller.authenticating.a705b075
source: Authenticating…
zh_hans: 正在认证…

source: Authentication is required to show the pairing code.
zh_hans: 需要认证才能显示配对码。

# ui.swift.companion.companionwizardwindowcontroller.back.76900f1b
source: Back
zh_hans: 返回

# ui.swift.companion.companionwizardwindowcontroller.close.7d9eb7ac
source: Close
zh_hans: 关闭

source: Companion Device Paired
zh_hans: Companion 设备已配对

# ui.swift.companion.companionwizardwindowcontroller.companion_plugin.56041357
source: companion plugin
zh_hans: Companion 插件

# ui.swift.companion.companionwizardwindowcontroller.confirm_the_code.d869860e
source: Confirm the Code
zh_hans: 确认代码

source: Downloading the AI plugin…
zh_hans: 正在下载 AI 插件…

source: Downloading the companion plugin…
zh_hans: 正在下载 Companion 插件…

source: Enable Companion Pairing
zh_hans: 启用 Companion 配对

source: Enter your API key to continue.
zh_hans: 输入您的 API 密钥以继续。

# ui.swift.companion.companionwizardwindowcontroller.get_an_api_key.42bc0c32
source: Get an API Key
zh_hans: 获取 API 密钥

# ui.swift.companion.companionwizardwindowcontroller.get_iterm2_buddy.7b7b4c6b
source: Get iTerm2 Buddy
zh_hans: 获取 iTerm2 Buddy

# ui.swift.companion.companionwizardwindowcontroller.granting_consent.7306b781
source: Granting consent…
zh_hans: 正在授予许可…

# ui.swift.companion.companionwizardwindowcontroller.install.569ca49f
source: Install
zh_hans: 安装

source: Install iTerm2 Buddy on Your iPhone
zh_hans: 在 iPhone 上安装 iTerm2 Buddy

# ui.swift.companion.companionwizardwindowcontroller.install_testflight.c7c23016
source: Install TestFlight
zh_hans: 安装 TestFlight

source: Join the iTerm2 Buddy Beta
zh_hans: 加入 iTerm2 Buddy 测试

source: Learn About the Companion App
zh_hans: 了解 Companion App

# ui.swift.companion.companionwizardwindowcontroller.next.1ff57a29
source: Next
zh_hans: 下一步

# ui.swift.companion.companionwizardwindowcontroller.ok.565339bc
source: OK
zh_hans: 好

source: On your iPhone, open iTerm2 Buddy and tap Scan. Then reveal the pairing code below and point the camera at it.
zh_hans: 在 iPhone 上打开 iTerm2 Buddy 并轻点“扫描”。然后显示下方配对码，并将摄像头对准它。

source: Pairing connects this Mac to the iTerm2 Buddy app on your iPhone. Install it now, then come back and continue.
zh_hans: 配对会将这台 Mac 连接到 iPhone 上的 iTerm2 Buddy App。请立即安装，然后返回此处继续。

# ui.swift.companion.companionwizardwindowcontroller.pairing_failed_0.ac70a54c
source: Pairing failed: %1$@
zh_hans: 配对失败：%1$@

# ui.swift.companion.companionwizardwindowcontroller.paste_your_api_key.e35b296b
source: Paste your API key
zh_hans: 粘贴您的 API 密钥

# ui.swift.companion.companionwizardwindowcontroller.provider.672f1efd
source: Provider:
zh_hans: 提供商：

source: Set Up a Companion Device
zh_hans: 设置 Companion 设备

source: Set Up Your Companion Device
zh_hans: 设置您的 Companion 设备

source: Setup Could Not Be Completed
zh_hans: 无法完成设置

# ui.swift.companion.companionwizardwindowcontroller.show_pairing_code.b183e71c
source: Show Pairing Code
zh_hans: 显示配对码

source: Show the Pairing Code
zh_hans: 显示配对码

source: That didn’t work. Tap Back to reveal a new code and scan again.
zh_hans: 未能完成配对。请轻点“返回”以显示新代码，然后重新扫描。

source: This installs the AI and Companion plugins and turns on both features. Afterward, iTerm2 can send data off this Mac, but only with your explicit consent.
zh_hans: 这会安装 AI 和 Companion 插件并启用这两项功能。此后，iTerm2 只有在获得您明确同意后才能将数据发送到这台 Mac 之外。

source: This installs the Companion plugin and turns on companion device pairing. Afterward, iTerm2 can send data off this Mac, but only with your explicit consent.
zh_hans: 这会安装 Companion 插件并启用 Companion 设备配对。此后，iTerm2 只有在获得您明确同意后才能将数据发送到这台 Mac 之外。

source: This is a beta build, so iTerm2 Buddy is distributed through TestFlight. Install TestFlight, then join the beta.
zh_hans: 这是测试版构建，因此 iTerm2 Buddy 通过 TestFlight 分发。请安装 TestFlight，然后加入测试。

# ui.swift.companion.companionwizardwindowcontroller.verify.eea2745e
source: Verify
zh_hans: 验证

# ui.swift.companion.companionwizardwindowcontroller.verifying.63bbd08c
source: Verifying…
zh_hans: 正在验证…

source: You can finish setting up in Companion Device Settings.
zh_hans: 您可以在 Companion 设备设置中完成设置。

source: Your companion device is paired and connected.
zh_hans: 您的 Companion 设备已配对并连接。

source: Your companion device is paired but iTerm2 isn’t listening for it yet. Reconnecting…
zh_hans: 您的 Companion 设备已配对，但 iTerm2 尚未监听其连接。正在重新连接…

source: Your companion device is paired. Waiting for it to connect.
zh_hans: 您的 Companion 设备已配对。正在等待其连接。

source: The agent needs you to choose a session.
zh_hans: 代理需要您选择一个会话。

# ui.swift.completionsui.completionswindow.bookmark.1bac4007
source: Bookmark
zh_hans: 书签

# ui.swift.completionsui.completionswindow.command.71316697
source: Command
zh_hans: 命令

# ui.swift.completionsui.completionswindow.file.50009ce1
source: File
zh_hans: 文件

# ui.swift.completionsui.completionswindow.folder.74ccd433
source: Folder
zh_hans: 文件夹

# ui.swift.completionsui.completionswindow.history.0e769600
source: History
zh_hans: 历史记录

# ui.swift.completionsui.completionswindow.navigate.5ea5fbe8
source: Navigate
zh_hans: 导航

# ui.swift.completionsui.completionswindow.search.49c266ba
source: Search
zh_hans: 搜索

# ui.swift.completionsui.completionswindow.thinking.a02f1cea
source: Thinking…
zh_hans: 正在思考…

# ui.swift.completionsui.completionswindow.web_search.d04fc7d7
source: Web Search
zh_hans: 网页搜索

# ui.swift.composer.commandexplainer.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.composer.commandexplainer.ok.565339bc
source: OK
zh_hans: 好
